Table of Contents
 Class WeldData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the single weld
public class WeldData
Inheritance
object
WeldData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 ConnectedPartIds
Id of the weld
public List<string> ConnectedPartIds { get; set; }
Property Value
List<string>
 End
End of the weld
public Point3D End { get; set; }
Property Value
Point3D
 Id
Id of the weld
public int Id { get; set; }
Property Value
int
 Material
Name of the material
public string Material { get; set; }
Property Value
string
 Name
Name of the weld
public string Name { get; set; }
Property Value
string
 Start
Start of the weld
public Point3D Start { get; set; }
Property Value
Point3D
 Thickness
Thickness of the weld
public double Thickness { get; set; }
Property Value
double
 WeldType
Type of the weld
public WeldType WeldType { get; set; }
Property Value
WeldType
 Edit this page